In [2]:
#TASK 1

name = ["Rashmi", "Prem", "Khushbu", "Manish", "Akshata", "Shreya", "Arfat", "Pawan", "Danish", "Anthony"]
marks_obtd_maths = [100, 120, 130, 150, 160, 170, 180, 150, 195, 145,]
import pandas as pd
S = pd.Series(name, index = marks_obtd_maths)
S

100     Rashmi
120       Prem
130    Khushbu
150     Manish
160    Akshata
170     Shreya
180      Arfat
150      Pawan
195     Danish
145    Anthony
dtype: object

In [3]:
import numpy as np
np.arange(0,11)

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [4]:
S = pd.Series(np.arange(0,10), index=name)
S

Rashmi     0
Prem       1
Khushbu    2
Manish     3
Akshata    4
Shreya     5
Arfat      6
Pawan      7
Danish     8
Anthony    9
dtype: int32

In [5]:
import numpy as np
S1 = pd.Series(name, index=np.arange(1,11))
S1

1      Rashmi
2        Prem
3     Khushbu
4      Manish
5     Akshata
6      Shreya
7       Arfat
8       Pawan
9      Danish
10    Anthony
dtype: object

In [6]:
#TASK 2

name = ["Rashmi", "Prem", "Khushbu", "Manish", "Akshata", "Shreya", "Arfat", "Pawan", "Danish", "Anthony"]
marks_obtd_physics = [150, 120, 130, 150, 160, 170, 180, 150, 195, 145,]
import pandas as pd
S1 = pd.Series(name, index = marks_obtd_physics)
S1

150     Rashmi
120       Prem
130    Khushbu
150     Manish
160    Akshata
170     Shreya
180      Arfat
150      Pawan
195     Danish
145    Anthony
dtype: object

In [7]:
S

Rashmi     0
Prem       1
Khushbu    2
Manish     3
Akshata    4
Shreya     5
Arfat      6
Pawan      7
Danish     8
Anthony    9
dtype: int32

In [8]:
print("The number of students whose score is 150 in maths and physics:\n", marks_obtd_maths, marks_obtd_physics)

The number of students whose score is 150 in maths and physics:
 [100, 120, 130, 150, 160, 170, 180, 150, 195, 145] [150, 120, 130, 150, 160, 170, 180, 150, 195, 145]

In [9]:
# TASK 3
dic={'Name':["Rashmi", "Prem", "Khushbu", "Manish", "Akshata", "Shreya", "Arfat", "Pawan", "Danish", "Anthony"],'marks_obtd_maths':
    [100, 120, 130, 150, 160, 170, 180, 150, 195, 145,],'marks_obtd_physics':[150, 120, 130, 150, 160, 170, 180, 150, 195, 145,]}

DF=pd.DataFrame(dic)
DF

      Name  marks_obtd_maths  marks_obtd_physics
0   Rashmi               100                 150
1     Prem               120                 120
2  Khushbu               130                 130
3   Manish               150                 150
4  Akshata               160                 160
5   Shreya               170                 170
6    Arfat               180                 180
7    Pawan               150                 150
8   Danish               195                 195
9  Anthony               145                 145

In [10]:
#TASK - 4
import pandas as pd
import numpy as np

price=np.random.randint(30000,50000,20)
c_module= np.arange(101,121)
c_price=pd.Series(price, index=c_module)
print("Price value of 20 cars:\n",c_price)

Price value of 20 cars:
 101    33210
102    46967
103    39514
104    46317
105    37443
106    37615
107    33921
108    30067
109    32443
110    44262
111    37860
112    40886
113    48608
114    47359
115    45968
116    46840
117    44912
118    32131
119    44247
120    49708
dtype: int32

In [11]:
# TASK- 5
c_price1=price[price>40000]
print(c_price1)
print("Total no of cars having price greater than $40000:",c_price1.size)

[46967 46317 44262 40886 48608 47359 45968 46840 44912 44247 49708]
Total no of cars having price greater than $40000: 11

In [12]:
# TASK- 6
import pandas as pd
import numpy as np

price=np.random.randint(30000,50000,20)
c_module= np.arange(101,121)
c_price=pd.Series(price, index=c_module)
c_price[10:16]

111    49566
112    47491
113    42861
114    33179
115    46517
116    49676
dtype: int32

In [13]:
# TASK- 7
c_data = c_price[(c_price>30000)&(c_price<40000)]
print("Number of cars in the range between $30000 to $40000 are:",c_data.size)

Number of cars in the range between $30000 to $40000 are: 9

In [14]:
#TASK - 8

avg=c_price.mean()
print("Average price: ",avg)
c_price2=c_price[c_price>avg]
print("The number of cars priced above the average price:",c_price2.size)

Average price:  40307.75
The number of cars priced above the average price: 11

In [15]:

#TASK - 9

new_sal=[34000,45000,54000]
new_id=[201,202,203]
new=pd.Series(new_sal,index=new_id)

new_data=pd.concat([c_data,new])
print("After adding the new record:\n",new_data)

After adding the new record:
 102    30041
103    34703
105    39820
106    31668
108    31488
114    33179
117    30130
118    32282
120    38735
201    34000
202    45000
203    54000
dtype: int64

In [33]:
#TASK-10

print('Before decrement')
print(c_data)
S10=c_data
S11=S10*0.9
#S10[(S10>40000*0.9)]
print("After decrement by 10%")
print(S11)

Before decrement
102    30041
103    34703
105    39820
106    31668
108    31488
114    33179
117    30130
118    32282
120    38735
dtype: int32
After decrement by 10%
102    27036.9
103    31232.7
105    35838.0
106    28501.2
108    28339.2
114    29861.1
117    27117.0
118    29053.8
120    34861.5
dtype: float64

In [40]:
# TASK- 11

print("Before decrement")
print(c_data.size)
S10=c_data
S11=S10[(S10>30000) & (S10<40000)]*0.9
print("After decrement")
print(S11.size)

Before decrement
9
After decrement
9

In [51]:
#TASK - 12

import numpy as np
import pandas as pd
num=np.sort(c_price)
av=num
print("Top 5 cheepest car price: ",av[1:6])

Top 5 cheepest car price:  [30130 31488 31668 32282 33179]